src/InformationRegisters/ЯзыкПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ЯзыкПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>client_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/Тележка/Ext/Module.bsl
Функция ПолучитьЯзык(client_id) экспорт
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ЯзыкПользователя.client_id КАК client_id,
	               |	ЯзыкПользователя.Язык КАК Язык
	               |ИЗ
	               |	РегистрСведений.ЯзыкПользователя КАК ЯзыкПользователя
	               |ГДЕ
	               |	ЯзыкПользователя.client_id = &client_id";
	запрос.УстановитьПараметр("client_id",client_id);
	выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() тогда
		возврат выборка.Язык
	иначе
		возврат "RU"
	конецесли;	
конецфункции
